%% 画坐标轴
%输入R：             旋转矩阵;
%输入t：             平移向量;
function p = plot_frame(R,t,len,lw)

o = t;
x = R*[len,0,0]';
y = R*[0,len,0]';
z = R*[0,0,len]';
a1 = line([o(1),o(1)+x(1)],[o(2),o(2)+x(2)],[o(3),o(3)+x(3)],'color',[0.843137254901961,0.149019607843137,0.172549019607843],'linewidth',lw);
a2 = line([o(1),o(1)+y(1)],[o(2),o(2)+y(2)],[o(3),o(3)+y(3)],'color',[0.152941176470588,0.631372549019608,0.278431372549020],'linewidth',lw);
a3 = line([o(1),o(1)+z(1)],[o(2),o(2)+z(2)],[o(3),o(3)+z(3)],'color','b','linewidth',lw);
p = [a1 a2 a3];
end

